List_of_books = [
    {"title" : "Маленький принц", "author" : "Антуан де Сент-Экзюпери", "year" : 1942},
    {"title" : "Малыш и Карлсон", "author" : "Астрид Линдгрен", "year" : 1955},
    {"title" : "Басни Крылова", "author" : "Иван Андреевич Крылов", "year" : 1808},
    {"title" : "Евгений Онегин", "author" : "Александр Сергеевич Пушкин", "year" : 1831},
    {"title" : "Война и мир", "author" : "Лев Николаевич Толстой", "year" : 1869}
]

index = 1

for i in List_of_books:
    print(f"---------------------- Книга№{index} ----------------------")
    print(f"Название: {List_of_books[i]["title"]}, Автор: {List_of_books[i]["author"]}")
    print(f"-------------------------{List_of_books[i]["year"]}-------------------------")
